[
    {"id": 1, "word": "productivity", "translation": "produktywność", "spelling": "/ˌprɒdʌkˈtɪvəti/",  "meaning": "The rate at which goods are produced", "examples": [["we need to increase productivity by 50%", "musimy zwiększyć wydajność o 50%"],  ["productivity improvement", "poprawa wydajności"]], "partOfspeech": [["noun", "productivity"], ["adjective", "productive"]], "favourites": "no", "passed": ""},
    {"id": 2, "word": "merge", "translation": "połączenie, złączenie, łączyć (się)","spelling": "/mɜːdʒ/", "meaning": "To combine or join together (or to be joined together), to make a larger company, organization, department, etc.", "examples": [["the two companies merged, forming the largest brewery in Canada", "obie firmy połączyły się, tworząc największy browar w Kanadzie"],  ["merge is the process of combining the various versions of a file or folder", "scalanie to proces łączenia różnych wersji pliku lub folderu"]], "partOfspeech": [["noun", "merger"], ["verb", "merge"] ], "favourites": "no", "passed": ""},
    {"id": 3, "word": "file", "translation": "plik", "spelling": "/faɪl/", "meaning": "A piece of text, a picture, or a computer program stored on a computer", "examples": [["do you want to download all these files?", "czy chcesz pobrać wszystkie te pliki?"], ["file sharing", "udostępnianie plików"]], "partOfspeech": [["noun", "file"]], "favourites": "no", "passed": ""},
    {"id": 4, "word": "iterate", "translation": "powtarzać", "spelling": "/ˈɪt.ər.eɪt/",  "meaning": "To repeat a process, especially as part of a computer program", "examples": [["perform iteration", "wykonać powtórzenie"],  ["it is now clear that we may iterate these constructions", "teraz jest jasne, że możemy iterować te konstrukcje"]], "partOfspeech": [["noun", "iteration"], ["verb", "iterate"]], "favourites": "no", "passed": ""},
    {"id": 5, "word": "advanced", "translation": "zaawansowany", "spelling": "/ədˈvɑːnst/",  "meaning": "At a higher, more difficult level", "examples": [["an advanced English course", "zaawansowany kurs angielskiego"],  ["advanced programming language", "zaawansowany język programowania"]], "partOfspeech": [["adjective", "advanced"]], "favourites": "no", "passed": "" },
    {"id": 6, "word": "promise", "translation": "obietnica", "spelling": "/ˈprɒm.ɪs/",  "meaning": "A declaration or assurance that one will do something or that a particular thing will happen", "examples": [["I'll try to get back in time, but I'm not making any promises", "spróbuję wrócić na czas, ale nie składam żadnych obietnic"],  ["the promise object represents the eventual completion (or failure) of an asynchronous operation, and its resulting value", "obiekt promise reprezentuje ostateczne zakończenie (lub niepowodzenie) operacji asynchronicznej i jej wynikową wartość."]], "partOfspeech": [["noun", "promise"], ["verb", "promise"]], "favourites": "no", "passed": "" },
    {"id": 7, "word": "next", "translation": "następny, kolejny", "spelling": "/nekst/",  "meaning": "Being the first one after the present one or after the one just mentioned", "examples": [["who works in the office next to yours?", "kto pracuje w biurze obok twojego?"],  ["what's the next programming language you want to learn?", "jaki jest następny język programowania, którego chcesz się nauczyć?"]], "partOfspeech": [["adjective", "next"], ["preposition", "next-to"]], "passed": "" },
    {"id": 8, "word": "save", "translation": "oszczędzać, zachować, zapisać", "spelling": "/seɪv/",  "meaning": "To put information into a computer's memory or onto a computer disk // To prevent time, money, or effort being wasted or spent", "examples": [["windows will scan your drive and let you know how much space you can save by running Disk Cleanup", "system Windows przeskanuje dysk i poinformuje, ile miejsca można zaoszczędzić, uruchamiając funkcję oczyszczanie dysku"],  ["by using loop instead of doing it handly, you can save a lot of time", "używając pętli zamiast robić to ręcznie zaoszczędzisz mnóstwo czasu"]], "partOfspeech": [["noun", "save"], ["verb", "save"]], "favourites": "no", "passed": "" },
    {"id": 9, "word": "perform", "translation": "wykonać", "spelling": "/pəˈfɔːm/",  "meaning": "To do an action or piece of work", "examples": [["we usually ask interviewees to perform a few simple tasks on the computer just to test their aptitude", "zazwyczaj prosimy rozmówców o wykonanie kilku prostych zadań na komputerze, aby przetestować ich umiejętności."],  ["computers can perform a variety of tasks", "komputery mogą wykonywać różne zadania"]], "partOfspeech": [["noun", "performer"], ["verb", "perform"], ["adjective", "performing"]], "favourites": "no", "passed": "" },
    {"id": 10, "word": "queue", "translation": "kolejka", "spelling": "/kjuː/",  "meaning": "A list of jobs that a computer has to do", "examples": [["there was a huge queue of people stretching down the road from the bank", "Wzdłuż drogi ciągnęła się ogromna kolejka ludzi"],  ["the server will not allow me to queue print jobs.", "serwer nie zezwala na kolejkowanie zadań drukowania"]], "partOfspeech": [["noun", "queue"], ["verb", "queue"]], "favourites": "no", "passed": ""},
    {"id": 11, "word": "catch", "translation": "złapać, chwycić","spelling": "/kætʃ/", "meaning": "To take hold of something", "examples": [["i managed to catch the glass before it hit the ground.", "udało mi się złapać szklankę, zanim spadła na ziemię"],  ["a try block is the block of code in which exceptions occur. A catch block catches and handles try block exceptions", "blok try to blok kodu, w którym pojawiają się wyjątki. Blok catch łapie (chwyta) wyjątki z bloku try"]], "partOfspeech": [["noun", "catch"], ["verb", "catch"] ], "favourites": "no", "passed": ""},
    {"id": 12, "word": "reversion", "translation": "powrót, odwrócenie czegoś", "spelling": "/rɪˈvɜː.ʃən/", "meaning": "The process of returning to a previous state or condition", "examples": [["he reverted to his native language", "wrócił do swojego ojczystego języka"], ["reversion is the abandonment of one or more recent changes in favor of a return to a previous version of the material at hand ", "cofnięcie to rezygnacja z jednej lub więcej ostatnich zmian na rzecz powrotu do poprzedniej wersji dostępnego materiału"]], "partOfspeech": [["noun", "reversion"], ["verb", "revert"]], "favourites": "no", "passed": ""},
    {"id": 13, "word": "shuffle", "translation": "przetasować, przemieszać", "spelling": "/ˈʃʌf.l̩/",  "meaning": "Play or arrange (tracks on a music player) in a random order", "examples": [["the controls lets you shuffle or skip songs by flicking the phone with your wrist", "kontrolki pozwalają tasować lub pomijać utwory, dotykając telefon nadgarstkiem"],  ["shuffle a given array using Fisher–Yates Shuffle Algorithm", "Przetasuj podaną tablicę za pomocą algorytmu losowania Fishera – Yatesa"]], "partOfspeech": [["noun", "shuffle"], ["verb", "shuffle"]], "favourites": "no", "passed": ""},
    {"id": 14, "word": "recursive", "translation": "rekurencyjny", "spelling": "/rɪˈkɜː.sɪv/",  "meaning": "Involve on doing or saying the same thing several times in order to produce a particular result or effect", "examples": [["Providing recursive queries to arbitrary IP addresses on the internet exposes a name server to both cache poisoning and denial of service attacks", "dostarczanie rekurencyjnych zapytań do dowolnych adresów IP w Internecie naraża serwer zarówno na zatrucie pamięci podręcznej, jak i ataki typu odmowa usługi"],  ["a recursive function is one that calls itself, often over and over again", "funkcja rekurencyjna to taka, która wywołuje samą siebie, często w kółko"]], "partOfspeech": [["adjective", "recursive"]], "favourites": "no", "passed": "" },
    {"id": 15, "word": "deep", "translation": "głęboki", "spelling": "/diːp/",  "meaning": "Going or being a long way down from the top or surface", "examples": [["the lake was deep and cold", "jezioro było głębokie i zimne"],  ["deep learning is a particular kind of machine learning that achieves great power and flexibility", "głębokie uczenie się jest szczególnym rodzajem uczenia maszynowego, który osiąga wielką moc i elastyczność"]], "partOfspeech": [["noun", "deep"], ["adjective", "deep"]], "favourites": "no", "passed": "" },
    {"id": 16, "word": "commit", "translation": "zatwierdzić, potwierdzić", "spelling": "/kəˈmɪt/",  "meaning": "To actively put information in your memory or write it down", "examples": [["these rules must be committed to memory.", "te zasady muszą być zapisane w pamięci"],  ["a commit statement in SQL ends a transaction within a relational database management system (RDBMS) and makes all changes visible to other users. ", "instrukcja COMMIT w SQL kończy transakcję w systemie zarządzania relacyjnymi bazami danych (RDBMS) i powoduje, że wszystkie zmiany są widoczne dla innych użytkowników"]], "partOfspeech": [["verb", "commit"]], "favourites": "no", "passed": "" },
    {"id": 17, "word": "message", "translation": "wiadomość", "spelling": "/ˈmes.ɪdʒ/",  "meaning": "A piece of information that appears on a computer screen", "examples": [["if I'm not there when you call, leave a message", "jeśli nie ma mnie, kiedy dzwonisz, zostaw wiadomość"],  ["an error message", "komunikat (wiadomość) o błędzie"]], "partOfspeech": [["noun", "message"], ["verb", "message"]], "favourites": "no", "passed": "" },
    {"id": 18, "word": "image", "translation": "obraz", "spelling": "/ˈɪm.ɪdʒ/",  "meaning": "A picture or photograph, especially one shown on a computer or television screen // An exact copy of a computer's hard disk, made for backing up data or setting up new machines", "examples": [["RAID 1 (known as mirroring) creates an identical image of data from one drive to a second drive or from multiple drives to a second set of multiple drives", "RAID 1 (znany jako mirroring) tworzy identyczny obraz danych z jednego dysku na drugi dysk lub z wielu dysków na drugi zestaw wielu dysków"], ["you can rotate the image, resize it, zoom in, zoom out, or adjust its color.", "możesz obracać obraz, zmieniać jego rozmiar, powiększać, pomniejszać lub dostosowywać jego kolor"]], "partOfspeech": [["noun", "image"], ["verb", "image"]], "favourites": "no", "passed": "" },
    {"id": 19, "word": "space", "translation": "przestrzeń, miejsce", "spelling": "/speɪs/",  "meaning": "An empty area that is available to be used // Capacity for storage of data in a computer or other digital device", "examples": [["most new computers come with at least 20 gigabytes of disk space", "większość nowych komputerów ma co najmniej 20 gigabajtów miejsca na dysku"],  ["additional disk space is required for the database operation", "dodatkowe miejsce na dysku jest wymagane do działania bazy danych"]], "partOfspeech": [["noun", "space"], ["verb", "space"]], "favourites": "no", "passed": ""},
    {"id": 20, "word": "previous", "translation": "poprzedni","spelling": "/ˈpriː.vi.əs/", "meaning": "happening or existing before something or someone else", "examples": [["she looked tired after her exertions of the previous evening", "wyglądała na zmęczoną po wysiłkach z poprzedniego wieczoru"],  ["can I learn PHP without any previous programming experience?", "czy mogę nauczyć się PHP bez wcześniejszego doświadczenia w programowaniu?"]], "partOfspeech": [["noun", "previous"], ["adjective", "previous"] ], "favourites": "no", "passed": ""},
    {"id": 21, "word": "provider", "translation": "dostawca", "spelling": "/prəˈvaɪ.dər/", "meaning": "Someone who provides something", "examples": [["the company is the largest provider of employment in the town", "firma jest największym dostawcą zatrudnienia w mieście"], ["UPC is one of the polish internet access provider", "UPC jest jednym z polskich dostawców internetu"]], "partOfspeech": [["noun", "provider"]], "favourites": "no", "passed": ""},
    {"id": 22, "word": "module", "translation": "moduł", "spelling": "/ˈmɒdʒ.uːl/",  "meaning": "A part of a computer or software system or program that has a function and works together with other related parts", "examples": [["virtual software machine running multiple program modules in a single address space of a target computer", "wirtualna maszyna uruchamia wiele modułów programu w jednej przestrzeni adresowej komputera docelowego"],  ["this module is a part of full computer program", "ten moduł jest częścią pełnego programu komputerowego"]], "partOfspeech": [["noun", "module"]], "favourites": "no", "passed": ""},
    {"id": 23, "word": "include", "translation": "zawierać", "spelling": "/ɪnˈkluːd/",  "meaning": "To contain something as a part of something else, or to make something part of something else", "examples": [["the report includes detailed financial information for the past five years", "raport zawiera szczegółowe informacje finansowe za ostatnie pięć lat"],  ["front-end languages mainly include HTML, CSS, and Javascript", "Języki front-endu zawierają głównie HTML, CSS i JavaScript"]], "partOfspeech": [["verb", "include"]], "favourites": "no", "passed": "" },
    {"id": 24, "word": "template", "translation": "szablon", "spelling": "/ˈtem.pleɪt/",  "meaning": "Something that serves as a model for others to copy // A preset format for a document or file", "examples": [["you can alter the look of your email template by changing the graphics and/or fields", "możesz zmienić wygląd szablonu wiadomości e-mail, zmieniając grafikę i / lub pola"],  ["you can use these templates as a basis for your website", "możesz użyć tych szablonów jako podstawy swojej witryny"]], "partOfspeech": [["noun", "template"]], "favourites": "no", "passed": "" },
    {"id": 25, "word": "example", "translation": "przykład", "spelling": "/ɪɡˈzɑːm.pəl/",  "meaning": "A thing characteristic of its kind or illustrating a general rule", "examples": [["in these two examples, you can see how easy it is", "na podstawie tych dwóch przykładów można zobaczyć, jakie to proste"],  ["lets see this code example", "zobaczmy ten przykład kodu"]], "partOfspeech": [["noun", "example"]], "favourites": "no", "passed": "" },
    {"id": 26, "word": "use", "translation": "używać", "spelling": "/juːz/",  "meaning": "To put something such as a tool, skill, or building to a particular purpose", "examples": [["this glass has been used - could you get me a clean one?", "ta szklanka była używana - możesz mi podać czystą?"],  ["what language will you use to write this program?", "jakiego języka użyjesz do napisania tego programu?"]], "partOfspeech": [["noun", "use"], ["verb", "use"]], "favourites": "no", "passed": "" },
    {"id": 27, "word": "require", "translation": "wymagać", "spelling": "/rɪˈkwaɪər/",  "meaning": "to need something or make something necessary", "examples": [["recommended minimum system requirements", "zalecane minimalne wymagania systemowe"],  ["this program will require you to use a loop with some IF statements", "ten program wymaga użycia pętli z niektórymi instrukcjami IF"]], "partOfspeech": [["verb", "require"]], "favourites": "no", "passed": "" },

    {"id": 28, "word": "theme", "translation": "motyw, temat", "spelling": "/θiːm/",  "meaning": "The main subject of a talk, book, film, etc.", "examples": [["the movies she makes are all variations on the same theme", "filmy, które kręci, są odmianami tego samego tematu"],  ["you should see this wordpress theme, it's fantastic", "powinieneś zobaczyć ten motyw Wordpress, jest fantastyczny"]], "partOfspeech": [["noun", "theme"], ["verb", "theme"]], "favourites": "no", "passed": "" }
]